<?php
$options = array(
	array( // первый метабокс
		'id'	=>	'info', // ID метабокса, а также префикс названия произвольного поля
		'name'	=>	'Дополнительная информация', // заголовок метабокса
		'post'	=>	array('post'), // типы постов для которых нужно отобразить метабокс
		'pos'	=>	'normal', // расположение, параметр $context функции add_meta_box()
		'pri'	=>	'high', // приоритет, параметр $priority функции add_meta_box()
		'cap'	=>	'edit_posts', // какие права должны быть у пользователя
		'args'	=>	array(
			array(
				'id'			=>	'art', // атрибуты name и id без префикса, например с префиксом будет meta1_field_1
				'title'			=>	'Артикул', // лейбл поля
				'type'			=>	'text', // тип, в данном случае обычное текстовое поле
				'placeholder'	=>	'Например: К00944', // атрибут placeholder
				'desc'			=>	'Заполните артикул', // что-то типа пояснения, подписи к полю
				'cap'			=>	'edit_posts'
			),
			array(
				'id'			=>	'weight', // атрибуты name и id без префикса, например с префиксом будет meta1_field_1
				'title'			=>	'Вес', // лейбл поля
				'type'			=>	'text', // тип, в данном случае обычное текстовое поле
				'placeholder'	=>	'Например: 3 гр.', // атрибут placeholder
				'desc'			=>	'Заполните вес', // что-то типа пояснения, подписи к полю
				'cap'			=>	'edit_posts'
			),
			array(
				'id'			=>	'import', // атрибуты name и id без префикса, например с префиксом будет meta1_field_1
				'title'			=>	'Вставки/Камни', // лейбл поля
				'type'			=>	'text', // тип, в данном случае обычное текстовое поле
				'placeholder'	=>	'Например: Алмаз', // атрибут placeholder
				'desc'			=>	'Заполните вставки', // что-то типа пояснения, подписи к полю
				'cap'			=>	'edit_posts'
			),
			array(
				'id'			=>	'price', // атрибуты name и id без префикса, например с префиксом будет meta1_field_1
				'title'			=>	'Цена', // лейбл поля
				'type'			=>	'text', // тип, в данном случае обычное текстовое поле
				'placeholder'	=>	'Например: 28 000 тг', // атрибут placeholder
				'desc'			=>	'Заполните цену', // что-то типа пояснения, подписи к полю
				'cap'			=>	'edit_posts'
			),
			array(
				'id'			=>	'size', // атрибуты name и id без префикса, например с префиксом будет meta1_field_1
				'title'			=>	'Размеры в наличии', // лейбл поля
				'type'			=>	'text', // тип, в данном случае обычное текстовое поле
				'placeholder'	=>	'Например: 18, 19, 20', // атрибут placeholder
				'desc'			=>	'Заполните размеры', // что-то типа пояснения, подписи к полю
				'cap'			=>	'edit_posts'
			)
		)
	)
);
 
foreach ($options as $option) {
	$truemetabox = new trueMetaBox($option);
}
?>